uhnp/src/InformationRegisters/ОбластиДействияАналоговМатериалов/ОбластиДействияАналоговМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбластиДействияАналоговМатериалов</name>
  <dimensions>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.РазрешениеНаЗаменуМатериалов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИзделия</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СтатусыРазрешенийНаЗаменуМатериалов/СтатусыРазрешенийНаЗаменуМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРазрешенийНаЗаменуМатериалов</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>Утверждено</name>
  </enumValues>
  <enumValues>
    <name>Прекращено</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/РазрешениеНаЗаменуМатериалов/РазрешениеНаЗаменуМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаЗаменуМатериалов</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Catalog.РесурсныеСпецификации</basedOn>
  <registerRecords>InformationRegister.АналогиМатериалов</registerRecords>
  <attributes>
    <name>УдалитьЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИзделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХарактеристикаИзделия</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРазрешенийНаЗаменуМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УказаниеПоПрименению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗамены</name>
    <type>
      <types>EnumRef.ВариантЗаменыАналогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимозаменяемыеАналоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиДействия</name>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаИзделия</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ОбластиДействияАналоговМатериалов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.ОбластиДействияАналоговМатериалов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.ОбластиДействияАналоговМатериалов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Версия = "2.5.21.22";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Многопоточный = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("841e54d6-b31c-420d-907e-1e435a403fd6");
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = НСтр("ru = 'Заполняет регистр сведений ""Области действия аналогов материалов"".';
									|en = 'Populates the ""Scopes of substitutes"" information register.'");
	
	ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	Приоритет = ПриоритетыВыполнения.Добавить();
	Приоритет.Порядок = "После";
	Приоритет.Процедура = "Документы.РазрешениеНаЗаменуМатериалов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	ПриоритетыВыполнения = ПриоритетыВыполнения;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.РазрешениеНаЗаменуМатериалов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ОбластиДействияАналоговМатериалов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
		
	ПолноеИмяРегистра = "РегистрСведений.ОбластиДействияАналоговМатериалов";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.РазрешениеНаЗаменуМатериалов";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РазрешениеНаЗаменуМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РазрешениеНаЗаменуМатериалов КАК РазрешениеНаЗаменуМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияАналоговМатериалов КАК ОбластиДействияАналоговМатериалов
	|		ПО ОбластиДействияАналоговМатериалов.Разрешение = РазрешениеНаЗаменуМатериалов.Ссылка
	|ГДЕ
	|	РазрешениеНаЗаменуМатериалов.Проведен
	|	И РазрешениеНаЗаменуМатериалов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРазрешенийНаЗаменуМатериалов.Утверждено)
	|	И ОбластиДействияАналоговМатериалов.Разрешение ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазрешениеНаЗаменуМатериалов.Дата УБЫВ";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Регистраторы);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры обработчика:
//   * ВерсияПодсистемыНаНачалоОбновления - Строка - версия подсистемы.
//   * ИмяОбработчика - Строка - имя обработчика.
//   * ОбновляемыеДанные - Структура.
//   * ОбработкаЗавершена - Булево, Неопределено - признак завершения обработки.
//   * Очередь - Число - очередь.
//   * ПрогрессВыполнения - Структура:
//     ** ВсегоОбъектов - Число - всего обработано объектов.
//     ** ОбработаноОбъектов - Число - обработано объектов.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ОбластиДействияАналоговМатериалов;
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ПолноеИмяДокумента = Метаданные.Документы.РазрешениеНаЗаменуМатериалов.ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяДокумента);
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Ссылка КАК Разрешение,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Подразделение КАК Подразделение,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Изделие КАК Изделие,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Спецификация КАК Спецификация,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Этап КАК Этап,
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_ДанныеТЧ
	|ИЗ
	|	Документ.РазрешениеНаЗаменуМатериалов.ОбластиДействия КАК РазрешениеНаЗаменуМатериаловОбластиДействия
	|ГДЕ
	|	РазрешениеНаЗаменуМатериаловОбластиДействия.Ссылка В (&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.Разрешение КАК Разрешение,
	|	ВТ_ДанныеТЧ.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВТ_ДанныеТЧ.Подразделение КАК Подразделение,
	|	ВТ_ДанныеТЧ.Изделие КАК Изделие,
	|	ВТ_ДанныеТЧ.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	ВТ_ДанныеТЧ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ДанныеТЧ.Спецификация КАК Спецификация,
	|	ВТ_ДанныеТЧ.Этап КАК Этап,
	|	ВТ_ДанныеТЧ.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазрешениеНаЗаменуМатериалов.Ссылка,
	|	РазрешениеНаЗаменуМатериалов.УдалитьНаправлениеДеятельности,
	|	РазрешениеНаЗаменуМатериалов.УдалитьПодразделение,
	|	РазрешениеНаЗаменуМатериалов.УдалитьИзделие,
	|	РазрешениеНаЗаменуМатериалов.УдалитьХарактеристикаИзделия,
	|	РазрешениеНаЗаменуМатериалов.УдалитьЗаказНаПроизводство,
	|	РазрешениеНаЗаменуМатериалов.УдалитьСпецификация,
	|	РазрешениеНаЗаменуМатериалов.УдалитьЭтап,
	|	РазрешениеНаЗаменуМатериалов.УдалитьЗаказКлиента
	|ИЗ
	|	Документ.РазрешениеНаЗаменуМатериалов КАК РазрешениеНаЗаменуМатериалов
	|ГДЕ
	|	РазрешениеНаЗаменуМатериалов.Ссылка В (&МассивСсылок)
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ
	|					ИСТИНА
	|				ИЗ
	|					ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|				ГДЕ
	|					ВТ_ДанныеТЧ.Разрешение = РазрешениеНаЗаменуМатериалов.Ссылка)";
	
	Запрос.УстановитьПараметр("МассивСсылок", ОбновляемыеДанные.ВыгрузитьКолонку("Ссылка"));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				БлокировкаДанных = Новый БлокировкаДанных;
				
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбластиДействияАналоговМатериалов");
				ЭлементБлокировкиДанных.УстановитьЗначение("Разрешение", Выборка.Разрешение);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
				
				БлокировкаДанных.Заблокировать();
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Разрешение.Установить(Выборка.Разрешение);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьПриОбновленииИнформационнойБазы");
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Разрешение);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстСообщения = НСтр("ru = 'Не удалось записать данные в регистр %ИмяРегистра% по причине: %Причина%';
										|en = 'Cannot write data to the %ИмяРегистра% register. Reason: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяРегистра%", ПолноеИмяОбъекта);
				
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					МетаданныеОбъекта, Неопределено, ТекстСообщения);
				
				ВызватьИсключение;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяДокумента);
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
